app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 04 Dec 2013 05:12:44 UTC +00:00], ["text", "Text 1"], ["title", "Title 1"], ["updated_at", Wed, 04 Dec 2013 05:12:44 UTC +00:00]]
---
	def create
  	@post = Post.new(params[:post].permit(:title, :text))

  	if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "Post Title 1"], ["text", "Post Text 1"], ["updated_at", Sat, 07 Dec 2013 18:36:58 UTC +00:00]]
---
		def update
  		@post = Post.find(params[:id])

  		if @post.update(params[:post].permit(:title, :text))